content/personal_lists/communities.md
+++
title = "Communities"
author = ["Hrishikesh Barman"]
draft = false
+++

This involves both offline and online community.


## I was part of {#i-was-part-of}


### Offline {#offline}

-   School and Tuition folks
-   Gauhati Artists' Guild
-   Bamunimaidan Drama School
-   Oil India badminton gang
-   Okonir naamghar (Khol classes)
-   Developers from Guwahati
-   Artists/Photographers/Videographers from Guwahati
-   Very small set of startup founders from Guwahati (idk man most of them are like idk doing shit that i don't really like but good for them)
-   College kids (did not like my time here at all)
-   Clarisights people


### Online {#online}

-   Few cool but niche twitter people from Bangalore and Delhi i guess
-   Indian hackathon(esp devfolio folks) and the opensource community
-   Prometheus people


## I want to be part of {#i-want-to-be-part-of}

These are communities/micro communities that I wish to explore and be a part of.


### Indie Developers {#indie-developers}

These are people who call themselves builders. They build businesses, some build for fun. The community primarily revolves around how we can monzonite our side projects and such. Some examples that I can recall, [Makerlog](https://getmakerlog.com/), [Barnacles,](https://barnacl.es/) [Indie Hackers](https://www.indiehackers.com/)


### Gamers {#gamers}

I didn't play a proper game since 2010. Been almost 12 years now. I loved to play games. I now have a desktop which can run most latest games, think I'll start gaming again and join the gaming people I know. They're very nice people.


### Rationality folks {#rationality-folks}

Some places I think which can be good starting points: [Gwern](https://www.gwern.net/), [Slate Star Codex](https://old.reddit.com/r/slatestarcodex/), [LessWrong](https://www.lesswrong.com/about)


### Twitter {#twitter}

I have been using twitter for many years, but never been a power user. Think as I am already using it, better use it properly and make more nice friends. Some resources which might help me up my game: [A Guide to Twitter](https://tasshin.com/blog/a-guide-to-twitter/) , [Advanced Search for Twitter](https://github.com/igorbrigadir/twitter-advanced-search)


### Reddit {#reddit}

If I had to list which websites changed my life in big ways, it has to be Google and Reddit. To me, Reddit is like the ISS of the internet. I always leave the site impressed, depressed or amused. At-least it makes me feel real things. I've been a lurker though, want to be more active there eventually.


### StackExchange {#stackexchange}

Stack Exchange is a network of question-and-answer websites on topics in diverse fields, each site covering a specific topic. Developers usually hang around stackoverflow but the other communities are also pretty awesome in my experience. Here are a few that I might just want to hang around: [Server Fault](https://serverfault.com/), [Database Administrators SE](https://dba.stackexchange.com/), [Cryptography SE](https://crypto.stackexchange.com/), [Information Security SE](https://security.stackexchange.com/), [Network Engineering SE](https://networkengineering.stackexchange.com/), [Electrical Engineering SE](https://electronics.stackexchange.com/), [Raspberry Pi SE](https://raspberrypi.stackexchange.com/), [Computer Science SE](https://cs.stackexchange.com/), [Unix &amp; Linux SE](https://unix.stackexchange.com/), [Mathematics SE](https://math.stackexchange.com/), [Physics SE](https://physics.stackexchange.com/)


### Guwahati Art and Design community {#guwahati-art-and-design-community}

Think these bunch are onto something. Pretty cool stuff.


## Resources {#resources}

Resources related to community building and communities in general.

-   [🤝 how to build and maintain communities](https://www.visakanv.com/blog/communities/)
-   [Strange Subculture List](https://knowingless.com/2016/08/21/strange-subculture-list/)
-   [orbit-model](https://github.com/orbit-love/orbit-model)
